ERP.belugaerp/src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СчетФактураВыданный</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_НомерДокументаУПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВыставления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/СчетФактураВыданный/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(бг_НомерДокументаУПП) Тогда
		Номер = бг_НомерДокументаУПП;
		ПредставлениеНомера = бг_НомерДокументаУПП;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("АктуализироватьДатуВыставленияСФ")
		И ЗначениеЗаполнено(ДатаВыставления) Тогда
		ДатаВыставления = Дата;
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("адаптер_ЭтоЗагрузкаДанных") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&После("ПриКопировании")
Процедура бг_ПриКопировании(ОбъектКопирования)
	
	бг_НомерДокументаУПП = "";
	ПредставлениеНомера = "";
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура бг_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	бг_ЗаполнитьОтветственных(ДанныеЗаполнения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура бг_ЗаполнитьОтветственных(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДанныеЗаполнения.ДокументОснование,
			"Руководитель, ГлавныйБухгалтер");
		Руководитель = Реквизиты.Руководитель;
		ГлавныйБухгалтер = Реквизиты.ГлавныйБухгалтер;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Руководитель, ГлавныйБухгалтер");
		Руководитель = Реквизиты.Руководитель;
		ГлавныйБухгалтер = Реквизиты.ГлавныйБухгалтер;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
